In [1]:
import pandas as pd

In [4]:
#data=pd.read_csv("CC_Expenses.csv")
data=  pd.DataFrame({'col1':[1,2,3,4], 'col2': ['abc','def','ghi','xyz'], 'col3': [111,222,333,444]})

In [5]:
data.head()

   col1 col2  col3
0     1  abc   111
1     2  def   222
2     3  ghi   333
3     4  xyz   444

In [6]:
data.tail()

   col1 col2  col3
0     1  abc   111
1     2  def   222
2     3  ghi   333
3     4  xyz   444

In [8]:
data.shape

(4, 3)

In [9]:
data.describe()

           col1        col3
count  4.000000    4.000000
mean   2.500000  277.500000
std    1.290994  143.300384
min    1.000000  111.000000
25%    1.750000  194.250000
50%    2.500000  277.500000
75%    3.250000  360.750000
max    4.000000  444.000000

In [10]:
data.drop("col1",axis=1)

  col2  col3
0  abc   111
1  def   222
2  ghi   333
3  xyz   444